{
    "page.name":"CUC UNIVERSITY",
    "menu.home": "Home",
    "menu.about-us": "About Us",
    "menu.academic-programs": "Academic Programs",
    "menu.academic-programs.UP": "Undergraduate Programs",
    "menu.academic-programs.GP": "Graduate Programs",
    "menu.academic-programs.aosiba": "Associates of Science International Business Administration",
    "menu.academic-programs.bosiiba": "Bachelors of Science in International Business Administration",
    "menu.academic-programs.mosiiba": "Master of Science in International Business Administration",
    "menu.academic-programs.mosimmcamt": "Master of Science in Mass Media Communication and Media Technology",
    "menu.academic-programs.mosim": "Master of Science in Marketing",
    "menu.students": "Students",
    "menu.admissions": "Admissions",
    "menu.scholarships": "Scholarships",
    "menu.contact-us": "Contact Us",
    "home.title": "Your future with CUC U",
    "home.introduction": "A distinguished American institution located in Miami, Florida, delivers a versatile hybrid educational approach that combines online and on-campus learning opportunities in English and Spanish.",
    "home.introduction.button": "See More",
    "home.circle-section.title": "With a primary emphasis on business education,",
    "home.circle-section.body": "CUC University is dedicated to providing students with the essential knowledge and skils to thrive in the competitive global marketplace.",
    "home.programs-section.title": "Academic Programs",
    "home.programs-section.type-one": "Undergraduate Programs",
    "home.programs-section.type-two": "Graduate Programs",
    "footer.title": "Join our Newsletter",
    "footer.body": "Stay up to date our news, blog post, and announcements by subscribing to our Newsletter.",
    "footer.button": "Subscribe",
    "aboutUs.title": "CUC University",
    "aboutUs.title-body": "a distinguished American institution located in Miami, Florida",
    "aboutUs.body-one": "A distinguished American institution located in Miami, Florida delivers a versatile hybrid educational approach that combines online and on-campus learning opportunities. Our comprehensive academic programs are offered in both Spanish and English, accommodating a diverse range of students.",
    "aboutUs.body-tow": "With a primary emphasis on business education, CUC University is dedicated to providing students with the essential knowledge and skills to thrive in the competitive global marketplace. Our unwavering commitment to excellence and quality ensures that our curriculum prepares students to adeptly navigate the ever-evolving business environment and apply their academic expertise to real-world challenges.",
    "aboutUs.circle-section.mission-title": "Mission",
    "aboutUs.circle-section.mission-body": "At CUC University, our mission is to train an integral citizen under the principle of freedom of thought and ideological pluralism, with a high sense of responsibility in the permanent search for academics and research, using to achieve it the development of science, technique, technology and culture.",
    "aboutUs.circle-section.vision-title": "Vision",
    "aboutUs.circle-section.vision-body": "CUC University was created with the desire to teach the next generation of skilled workers to face the challenges of the continually growing business world. Our vision is to be a leading university in the education of highly skilled citizens who are committed to society and the sustainable development of the country. We strive to be recognized for our academic excellence and our contribution to the advancement of science and technology.",
    "aboutUs.circle-section.values-title": "Values",
    "aboutUs.circle-section.values-body": "Our core values are excellence, responsibility integrity, and commitment to society, These values are reflected in everything we do, from teaching and research to interaction with our students, faculty, and administrative staff.",
    "aboutUs.statement.title": "Statement of Purpose",
    "aboutUs.statement.one": "Provide undergraduate and master's programs with an environment that focuses on all dimensions of learning - knowledge, understanding, skills, behaviors, values, and attitudes.",
    "aboutUs.statement.two": "Create and disseminate knowledge on important business issues through research, innovation, and rewarding learning experiences.",
    "aboutUs.statement.three": "Serve society through the exchange of ideas and practices.",
    "aboutUs.statement.four": "Practice ethical leadership by managing our resources effectively and efficiently.",
    "aboutUs.statement.five": "Foster a culture of excellence, inclusion, collaboration, and respect for diverse ideas",
    "aboutUs.accreditation.title": "Accreditation",
    "aboutUs.accreditation.body": "CUC University is a private institution organized as a for profit corporation under the laws of the State of Florida. It is licensed under the Commission for Independent Education Florida Department of Education, to provide post-secondary education and has authority to grant degrees under the laws of the State of Florida.",

    "programs.overview-title": "Overview",
    "programs.overview.duration-title": "Duration:",
    "programs.overview.credits-title": "Credits:",
    "programs.overview.modality-title": "Modality:",
    "programs.overview.language-title": "Language:",

    "programs.pdf-text": "Study Plan and Course Catalogue",
    "programs.pdf-button": "Download",
    "programs.bosiiba.objective.title": "Objective",
    "programs.bosiiba.description.title": "Description",
    


    "programs.aosiba.title-complete.type": "Associates of Science",
    "programs.aosiba.title-complete.specialty": "in International Business Administration",
    "programs.aosiba.overview.duration.content": "60 weeks (4 semesters)",
    "programs.aosiba.overview.credits.content": "60",
    "programs.aosiba.overview.modality.content": "Fully Online, On Campus or Hybrid",
    "programs.aosiba.overview.language.content": "English or Spanish",
    "programs.aosiba.objective.title": "Objective",
    "programs.aosiba.objective.body": "The Associate of Science in International Business serves as a foundational step towards completing a bachelo's degree, aiming to develop well-rounded individuals who can excel in the global marketplace. This program equips students with a comprehensive understanding of management principles, international business, and interpersonal skills, while fostering critical thinking and adaptability in the face of diverse business challenges. Additionally, the program emphasizes ethical decision-making and sustainable practices, preparing students to become responsible leaders in the international business arena.",
    "programs.aosiba.description.title": "Description",
    "programs.aosiba.description.body": "This program encompasses courses designed to prepare students for the workplace by offering insights into international trade, cultural differences, and global business strategies. These classes provide a solid grounding in the professional environment, introducing students to key concepts that will prove valuable throughout their academic journey and beyond. By engaging with this curriculum, students will gain valuable knowledge and skills, including effective communication, problem-solving, and teamwork, which are essential in the international business arena. Upon completion, graduates will be well-prepared to pursue further education or enter the workforce with confidence in their abilities to navigate the global business landscape.",



    "programs.bosiiba.title-complete.type": "Bachelors of Science",
    "programs.bosiiba.title-complete.specialty": "in International Business Administration",
    "programs.bosiiba.overview.duration.content": "120 weeks (8 semesters)",
    "programs.bosiiba.overview.credits.content": "120",
    "programs.bosiiba.overview.modality.content": "Fully Online, On Campus or Hybrid",
    "programs.bosiiba.overview.language.content": "English or Spanish",
    "programs.bosiiba.objective.body": "The objective of the BS in Business Administration is to equip students with a comprehensive, career-oriented business education that emphasizes personal and professional integrity, as well as social responsibility. The program aims to develop competencies in written and oral communications, quantitative analysis, critical and creative thinking. and management skills, with a focus on social and corporate responsibility.",
    "programs.bosiiba.description.body": "Graduates of the BS in Business Administration program will possess a deep understanding of business theories, policies, and procedures, preparing them for a successful career in the world of business. They will acquire essential skills in decision-making, problem-solving, and leadership, in addition to fundamental business and management practices. The program nurtures students' commitment to personal values, moral excellence, and professional competence, enabling them to excel in their chosen field.",


    "programs.mosiiba.title-complete.type": "Master of Science",
    "programs.mosiiba.title-complete.specialty": "in International Business Administration",
    "programs.mosiiba.overview.duration.content": "60 weeks (8 semesters)",
    "programs.mosiiba.overview.credits.content": "42",
    "programs.mosiiba.overview.modality.content": "Fully Online, On Campus or Hybrid",
    "programs.mosiiba.overview.language.content": "English or Spanish",
    "programs.mosiiba.objective.body": "In an increasingly globalized world, the Master's in International Business (MIB) program aims to provide robust content and managerial development opportunities. This program prepares students for active leadership roles in the global business landscape. Teaching focuses on equipping students to function effectively in culturally diverse settings, emphasizing inclusivity for individuals from all backgrounds.",
    "programs.mosiiba.description.body": "The Master's in International Business program is designed to enhance students' abilities to act strategically in an international business environment. reinforcing their analytical and decision-making skills in functional areas such as international marketing and finance, multinational operations, and human resource management, students will become effective global leaders in the international business domain. The curriculum is tailored to foster adaptability and leadership, enabling graduates to excel in the global business arena",
   

    
    "programs.mosim.title-complete.type": "Master of Science",
    "programs.mosim.title-complete.specialty": "in Marketing",
    "programs.mosim.overview.duration.content": "60 weeks (4 semesters)",
    "programs.mosim.overview.credits.content": "39",
    "programs.mosim.overview.modality.content": "Fully Online, On Campus or Hybrid",
    "programs.mosim.overview.language.content": "English or Spanish",
    "programs.mosim.objective.body": "The Master of Science in Marketing program aims to train individuals as marketing professionals, addressing the career needs of those with varying levels of experience in marketing, whether through employment or classroom instruction. Students acquire the knowledge and credentials necessary to advance their careers through focused classroom instruction, emphasizing the inclusion of all cultural groups.",
    "programs.mosim.description.body": "Marketing management is a critical function within any business organization, drawing on concepts from the behavioral sciences, economics, and quantitative methods. Marketing managers face the challenge of developing strategies that achieve the company's objectives while providing customer satisfaction more effectively than competitors. The Master of Science in Marketing program prepares students for careers in marketing management, product management, sales management, advertising, and related staff positions, equipping them with the skills and knowledge to excel in their chosen field.",


    "programs.mosimmcamt.title-complete.type": "Master of Science",
    "programs.mosimmcamt.title-complete.specialty": "in Mass Media Communication and Media Technology",
    "programs.mosimmcamt.overview.duration.content": "60 weeks (4 semesters)",
    "programs.mosimmcamt.overview.credits.content": "42",
    "programs.mosimmcamt.overview.modality.content": "Fully Online, On Campus or Hybrid",
    "programs.mosimmcamt.overview.language.content": "English or Spanish",
    "programs.mosimmcamt.objective.body": "The objective of this program is to prepare students for careers in news reporting, editing, digital media, television, public relations, and other mass media outlets. Graduates typically find employment in businesses, government agencies, professional, and non-profit organizations. Some pursue careers in advertising or specialized communication fields such as writing about medicine, technology, or business, while others choose to explore opportunities in \"new media\" - interactive computer systems and information distribution.",
    "programs.mosimmcamt.description.body": "The program offers a comprehensive understanding of electronic media from both theoretical and practical perspectives. The curriculum is designed to prepare students for diverse careers in Mass Media Communication, equipping them with the knowledge and skills necessary to excel in a rapidly evolving media landscape. Through hands-on experiences and in-depth coursework, students will gain the expertise required to navigate the dynamic world of mass media effectively.",


    "contactus.title":"Leave us your details and we will contact you",
    "contactus.nameForm":"Name",
    "contactus.LastNameForm":"Last Name",
    "contactus.PhoneForm":"Phone",
    "contactus.EmailForm":"Email",
    "contactus.MessageForm":"Message",
    "contactus.SendForm":"Send",
    "contactus.terms-and-conditions":"I have read and accept",
    "contactus.terms-and-conditionsv2":"the terms and conditions",
    "Students.title":"Students",
    "Students.textmain":"This will be the page where students find relevant information and tools including log in to Campus Café, Canva, Online Payments Library Resources, University Catalog and Academic Calendar.",
    "Students.fall":"FALL 2022",
    "Students.SPRING":"SPRING 2023",
    "Students.falldate0":"August 29, 2022",
    "Students.falldate1":"August 29- September 6, 2022",
    "Students.falldate2":"November 10-December 1, 2022",
    "Students.falldate3":"Semester November 11, 2022",
    "Students.falldate4":"December 2-19, 2022",
    "Students.falldate5":"December 16, 2022",
    "Students.falldate6":"November 24, 2022",
    "Students.falldate7":"November 24-28, 2022",
    "Students.falldate8":"November 25, 2022",
    "Students.falldate9":"December 26, 2022",
    "Students.falldescription0":"Fall semesters begin",
    "Students.falldescription1":"ADD/DROP Period for Fall 2022 semester",
    "Students.falldescription2":"Early Registration and Payment for Spring 2023",
    "Students.falldescription3":"Veterans Day",
    "Students.falldescription4":"Regular Registration",
    "Students.falldescription5":"Fall Semester ends",
    "Students.falldescription6":"Thanksgiving Day",
    "Students.falldescription7":"Thanksgiving break (no classes)",
    "Students.falldescription8":"Black Friday",
    "Students.falldescription9":"Christmas Day",
    "Students.springdate0":"January 1, 2023",
    "Students.springdate1":"January 16, 2023",
    "Students.springdate2":"January 23, 2023",
    "Students.springdate3":"January 23-27, 2023",
    "Students.springdate4":"April 10-16, 2023",
    "Students.springdate5":"April 20 -May 9, 2023",
    "Students.springdate6":"May 12-16, 2023",
    "Students.springdate7":"May 12, 2023",
    "Students.springdescription0":"New Years Day",
    "Students.springdescription1":"Martin Luther King",
    "Students.springdescription2":"Spring Semester begins",
    "Students.springdescription3":"ADD/DROP Period for Spring 2023 semester",
    "Students.springdescription4":"Spring Break (no classes)",
    "Students.springdescription5":"Regular registration for Summer and Fall 2023 semesters",
    "Students.springdescription6":"Late Registration for Summer and Fall 2023 semesters",
    "Students.springdescription7":"Spring Semester ends",
    "admissions.title":"ADMISSIONS",
    "admissions.subtitle":"Admissions Requirements",
    "admissions.masterpro":"Masters Programs",
    "admissions.masterpro0":"Hold a bachelor' s degree from a college or university (Provide copy of sealed transcripts).",
    "admissions.masterpro1":"Submit a completed Admissions Application.",
    "admissions.masterpro2":"Submit a One Time Application Fee: $100.00 (Non-Refundable).",
    "admissions.masterpro3":"Submit an updated Resume.",
    "admissions.masterpro4":"Submit 3 letters of professional references (non-family members).",
    "admissions.masterpro5":"Submit a personal statement that describes the applicant's professional accomplishments and goals.",
    "admissions.masterpro6":"Copy of valid government issued ID",
    "admissions.undergrapro":"Undergraduate Programs",
    "admissions.undergrapro0":"Submit A High School Diploma, A GED or proof of post-secondary education.",
    "admissions.undergrapro1":"Submit A Completed Admissions Application.",
    "admissions.undergrapro2":"Submit a One Time Application Fee: $100.00 (Non-Refundable)",
    "admissions.undergrapro3":"Copy of Valid Government Issued ID",
    "scholarships.title":"SCHOLARSHIPS",
    "scholarships.parr0":"CUC University is committed to supporting eligible students through a variety of scholarships, which are awarded on a semester basis and renewable based on satisfactory academic progress. Upon completing the scholarship application, eligible candidates will be scheduled for an interview and asked to compose a 300-word essay on campus. The essay topic will be randomly selected.",
    "scholarships.parr1":"All students who receive CUC University scholarships must maintain a 3.0 GPA to remain eligible for renewal. Scholarship recipients are required to reaffirm their commitment to the scholarship terms by signing the 'Terms for Institutional Scholarships' form.",
    "scholarships.parr2":"Application deadlines for each semester will be posted on the university website. It is essential to note that upon withdrawal or failure of courses, recipients of institutional aid will forfeit the CUC University scholarship and become financially liable for the full tuition of the ongoing semester."


























































}