{
    "menu.home": "Inicio",
    "menu.about-us": "Nosotros",
    "menu.academic-programs": "Programas Académicos",
    "menu.academic-programs.UP": "Programas de Pregrado",
    "menu.academic-programs.GP": "Programas de Posgrado",
    "menu.academic-programs.aosiba": "Asociado en Ciencias en Administración de Negocios Internacionales",
    "menu.academic-programs.bosiiba": "Licenciatura en Ciencias en Administración de Negocios Internacionales",
    "menu.academic-programs.mosiiba": "Maestría en Administración de Negocios Internacionales",
    "menu.academic-programs.mosim": "Maestría en Marketing",
    "menu.academic-programs.mosimmcamt": "Maestría en Comunicación de Medios Masivos y Tecnología de Medios",
    "menu.students": "Estudiantes",
    "menu.admissions": "Admisiones",
    "menu.scholarships": "Becas",
    "menu.contact-us": "Contáctenos",
    "home.title": "Tu futuro con CUC U",
    "home.introduction": "Una distinguida institución americana ubicada en Miami, Florida, ofrece un enfoque educativo híbrido versátil que combina oportunidades de aprendizaje en línea y presenciales. Nuestros programas académicos completos se ofrecen tanto en español como en inglés, acomodando a una amplia gama de estudiantes.",
    "home.introduction.button": "Ver Mas",
    "home.circle-section.title": "Con un énfasis principal en la educación empresarial,",
    "home.circle-section.body": "La Universidad CUC se dedica a proporcionar a los estudiantes los conocimientos y habilidades esenciales para prosperar en el competitivo mercado global.",
    "home.programs-section.title": "Programas Académicos",
    "home.programs-section.type-one": "Programas Académicos",
    "home.programs-section.type-two": "Programas de posgrado",
    "footer.title": "Suscríbase a nuestro boletín",
    "footer.body": "Manténgase al día con nuestras noticias, publicaciones de blog y anuncios suscribiéndose a nuestro boletín.",
    "footer.input.placeholder": "Ingrese su correo electrónico",
    "footer.button": "Suscribirse",
    "aboutUs.title": "CUC University",
    "aboutUs.title-body": "una distinguida institución americana ubicada en Miami, Florida",
    "aboutUs.body-one": "Una distinguida institución americana ubicada en Miami, Florida ofrece un enfoque educativo híbrido versátil que combina oportunidades de aprendizaje en línea y presenciales. Nuestros programas académicos completos se ofrecen tanto en español como en inglés, acomodando a una amplia gama de estudiantes.",
    "aboutUs.body-tow": "Con un énfasis principal en la educación empresarial, CUC University se dedica a proporcionar a los estudiantes el conocimiento y las habilidades esenciales para prosperar en el competitivo mercado global. Nuestro compromiso inquebrantable con la excelencia y la calidad garantiza que nuestro plan de estudios prepare a los estudiantes para navegar hábilmente en el entorno empresarial en constante evolución y aplicar su experiencia académica a los desafíos del mundo real.",
    "aboutUs.circle-section.mission-title": "Misión",
    "aboutUs.circle-section.mission-body": "En CUC University, nuestra misión es formar un ciudadano integral bajo el principio de libertad de pensamiento y pluralismo ideológico, con un alto sentido de responsabilidad en la búsqueda permanente de la académica y la investigación, utilizando para lograrlo el desarrollo de la ciencia, técnica, tecnología y cultura.",
    "aboutUs.circle-section.vision-title": "Visión",
    "aboutUs.circle-section.vision-body": "CUC University fue creada con el deseo de enseñar a la próxima generación de trabajadores capacitados para enfrentar los desafíos del mundo empresarial en constante crecimiento. Nuestra visión es ser una universidad líder en la educación de ciudadanos altamente capacitados que estén comprometidos con la sociedad y el desarrollo sostenible del país. Nos esforzamos por ser reconocidos por nuestra excelencia académica y nuestra contribución al avance de la ciencia y la tecnología.",
    "aboutUs.circle-section.values-title": "Valores",
    "aboutUs.circle-section.values-body": "Nuestros valores fundamentales son la excelencia, la responsabilidad, la integridad y el compromiso con la sociedad. Estos valores se reflejan en todo lo que hacemos, desde la enseñanza e investigación hasta la interacción con nuestros estudiantes, profesores y personal administrativo.",
    "aboutUs.statement.title": "Propósito",
    "aboutUs.statement.one": "Proporcionar programas de licenciatura y maestría con un ambiente que se enfoque en todas las dimensiones del aprendizaje: conocimiento, comprensión, habilidades, comportamientos, valores y actitudes.",
    "aboutUs.statement.two": "Crear y difundir conocimiento sobre importantes cuestiones empresariales a través de la investigación, innovación y experiencias de aprendizaje gratificantes.",
    "aboutUs.statement.three": "Servir a la sociedad a través del intercambio de ideas y prácticas.",
    "aboutUs.statement.four": "Practicar un liderazgo ético mediante la gestión efectiva y eficiente de nuestros recursos.",
    "aboutUs.statement.five": "Fomentar una cultura de excelencia, inclusión, colaboración y respeto por las ideas diversas.",
    "aboutUs.accreditation.title": "Acreditación",
    "aboutUs.accreditation.body": "CUC University es una institución privada organizada como una corporación con fines de lucro bajo las leyes del Estado de Florida. Está licenciada bajo la Comisión para la Educación Independiente del Departamento de Educación de Florida, para proporcionar educación postsecundaria y tiene autoridad para otorgar títulos bajo las leyes del Estado de Florida.",
    "programs.overview-title": "Visión General",
    "programs.overview.duration-title": "Duración:",
    "programs.overview.credits-title": "Créditos:",
    "programs.overview.modality-title": "Modalidad:",
    "programs.overview.language-title": "Idioma:",
    "programs.aosiba.description.title": "Descripción",
    "programs.aosiba.objective.title": "Objetivo",
    "programs.pdf-text": "Clases - Enlace al Plan de Estudios y Catálogo de Cursos",
    "programs.pdf-button": "Descargar",

    "programs.aosiba.title-complete.type": "Asociado en Ciencias",
    "programs.aosiba.title-complete.specialty": "en Administración de Negocios Internacionales",
    "programs.aosiba.overview.duration.content": "60 semanas (4 semestres)",
    "programs.aosiba.overview.credits.content": "60",
    "programs.aosiba.overview.modality.content": "Totalmente en línea, en el campus o híbrido",
    "programs.aosiba.overview.language.content": "inglés o español",
    "programs.aosiba.objective.body": "El Asociado en Ciencias en Negocios Internacionales sirve como un paso fundamental para completar una licenciatura, con el objetivo de desarrollar individuos integrales que puedan destacar en el mercado global. Este programa equipa a los estudiantes con una comprensión integral de los principios de gestión, negocios internacionales y habilidades interpersonales, mientras fomenta el pensamiento crítico y la adaptabilidad frente a diversos desafíos empresariales. Además, el programa enfatiza la toma de decisiones éticas y prácticas sostenibles, preparando a los estudiantes para convertirse en líderes responsables en el ámbito de los negocios internacionales.",
    "programs.aosiba.description.body": "Este programa abarca cursos diseñados para preparar a los estudiantes para el lugar de trabajo al ofrecer conocimientos sobre comercio internacional, diferencias culturales y estrategias de negocios globales. Estas clases proporcionan una base sólida en el entorno profesional, introduciendo a los estudiantes a conceptos clave que serán valiosos a lo largo de su trayectoria académica y más allá. Al participar en este plan de estudios, los estudiantes adquirirán conocimientos y habilidades valiosas, incluyendo comunicación efectiva, resolución de problemas y trabajo en equipo, que son esenciales en el ámbito de los negocios internacionales. Al finalizar, los graduados estarán bien preparados para continuar su educación o ingresar a la fuerza laboral con confianza en sus habilidades para navegar por el panorama de los negocios globales.",

    "programs.bosiiba.title-complete.type": "Licenciatura en Ciencias ",
    "programs.bosiiba.title-complete.specialty": "en Administración de Negocios Internacionales",
    "programs.bosiiba.overview.duration.content": "120 weeks (8 semesters)",
    "programs.bosiiba.overview.credits.content": "120",
    "programs.bosiiba.overview.modality.content": "Totalmente en línea, en el campus o híbrido",
    "programs.bosiiba.overview.language.content": "Inglés o español",
    "programs.bosiiba.objective.body": "El objetivo de la Licenciatura en Administración de Empresas es equipar a los estudiantes con una educación empresarial integral orientada a la carrera que enfatiza la integridad personal y profesional, así como la responsabilidad social. El programa tiene como objetivo desarrollar competencias en comunicaciones escritas y orales, análisis cuantitativo, pensamiento crítico y creativo, y habilidades de gestión, con un enfoque en la responsabilidad social y corporativa.",
    "programs.bosiiba.description.body": "Los graduados del programa de Licenciatura en Administración de Empresas poseerán una profunda comprensión de las teorías, políticas y procedimientos de los negocios, preparándolos para una carrera exitosa en el mundo de los negocios. Adquirirán habilidades esenciales en la toma de decisiones, resolución de problemas y liderazgo, además de las prácticas fundamentales de administración y gestión de negocios. El programa fomenta el compromiso de los estudiantes con los valores personales, la excelencia moral y la competencia profesional, lo que les permite sobresalir en su campo elegido.",
    
    

    "programs.mosiiba.title-complete.type": "Maestría en Administración ",
    "programs.mosiiba.title-complete.specialty": "de Negocios Internacionales",
    "programs.mosiiba.overview.duration.content": "60 weeks (8 semesters)",
    "programs.mosiiba.overview.credits.content": "42",
    "programs.mosiiba.overview.modality.content": "Totalmente en línea, en el campus o híbrido",
    "programs.mosiiba.overview.language.content": "Inglés o español",
    "programs.mosiiba.objective.body": "En un mundo cada vez más globalizado, el programa de Maestría en Negocios Internacionales (MIB) tiene como objetivo proporcionar un contenido sólido y oportunidades de desarrollo gerencial. Este programa prepara a los estudiantes para roles activos de liderazgo en el panorama empresarial global. La enseñanza se enfoca en equipar a los estudiantes para funcionar efectivamente en entornos culturalmente diversos, enfatizando la inclusividad para individuos de todos los orígenes.",
    "programs.mosiiba.description.body": "El programa de Maestría en Negocios Internacionales está diseñado para mejorar las habilidades de los estudiantes para actuar estratégicamente en un entorno de negocios internacionales. Al reforzar sus habilidades analíticas y de toma de decisiones en áreas funcionales como marketing y finanzas internacionales, operaciones multinacionales y gestión de recursos humanos, los estudiantes se convertirán en líderes globales efectivos en el dominio de los negocios internacionales. El plan de estudios está diseñado para fomentar la adaptabilidad y el liderazgo, permitiendo a los graduados sobresalir en el ámbito empresarial global.",



    "programs.mosim.title-complete.type": "Maestría ",
    "programs.mosim.title-complete.specialty": "en Marketing",
    "programs.mosim.overview.duration.content": "60 weeks (4 semesters)",
    "programs.mosim.overview.credits.content": "39",
    "programs.mosim.overview.modality.content": "Totalmente en línea, en el campus o híbrido",
    "programs.mosim.overview.language.content": "Inglés o español",
    "programs.mosim.objective.body": "El programa de Maestría en Ciencias en Marketing tiene como objetivo formar a individuos como profesionales de marketing, abordando las necesidades de carrera de aquellos con diferentes niveles de experiencia en marketing, ya sea a través del empleo o la instrucción en el aula. Los estudiantes adquieren los conocimientos y las credenciales necesarias para avanzar en sus carreras a través de la instrucción enfocada en el aula, enfatizando la inclusión de todos los grupos culturales.",
    "programs.mosim.description.body": "La gestión de marketing es una función crítica dentro de cualquier organización empresarial, basándose en conceptos de las ciencias del comportamiento, la economía y los métodos cuantitativos. Los gerentes de marketing enfrentan el desafío de desarrollar estrategias que logren los objetivos de la compañía mientras brindan satisfacción al cliente de manera más efectiva que los competidores. El programa de Maestría en Ciencias en Marketing prepara a los estudiantes para carreras en gestión de marketing, gestión de productos, gestión de ventas, publicidad y puestos relacionados con el personal, equipándolos con las habilidades y conocimientos para sobresalir en su campo elegido.",


    
    "programs.mosimmcamt.title-complete.type": "Maestría en Comunicación",
    "programs.mosimmcamt.title-complete.specialty": "de Medios Masivos y Tecnología de Medios",
    "programs.mosimmcamt.overview.duration.content": "60 weeks (4 semesters)",
    "programs.mosimmcamt.overview.credits.content": "42",
    "programs.mosimmcamt.overview.modality.content": "Totalmente en línea, en el campus o híbrido",
    "programs.mosimmcamt.overview.language.content": "Inglés o español",
    "programs.mosimmcamt.objective.body": "El objetivo de este programa es preparar a los estudiantes para carreras en reportaje de noticias, edición, medios digitales, televisión, relaciones públicas y otros medios masivos. Los graduados generalmente encuentran empleo en empresas, agencias gubernamentales, organizaciones profesionales y sin fines de lucro. Algunos persiguen carreras en publicidad o campos de comunicación especializados como escribir sobre medicina, tecnología o negocios, mientras que otros eligen explorar oportunidades en los \"nuevos medios\" - sistemas interactivos de computadora y distribución de información.",
    "programs.mosimmcamt.description.body": "El programa ofrece una comprensión integral de los medios electrónicos desde perspectivas teóricas y prácticas. El plan de estudios está diseñado para preparar a los estudiantes para carreras diversas en Comunicación de Medios Masivos, equipándolos con los conocimientos y habilidades necesarios para sobresalir en un paisaje mediático en rápida evolución. A través de experiencias prácticas y cursos en profundidad, los estudiantes adquirirán la experiencia requerida para navegar efectivamente el mundo dinámico de los medios masivos.",




































"contactus.title":"Déjenos sus datos y nos pondremos en contacto con usted",
"contactus.nameForm":"Nombre",
"contactus.LastNameForm":"Apellido",
"contactus.PhoneForm":"Teléfono",
"contactus.EmailForm":"Correo electrónico",
"contactus.MessageForm":"Mensaje",
"contactus.SendForm":"Enviar",
"contactus.terms-and-conditions":"He leído y acepto",
"contactus.terms-and-conditionsv2":"los términos y condiciones",
"Students.title":"Estudiantes",
"Students.textmain":"Esta será la página en la que los estudiantes encontrarán información y herramientas relevantes, como el inicio de sesión en Campus Café, Canva, los recursos de la biblioteca de pagos en línea, el catálogo de la universidad y el calendario académico.",
"Students.fall":"OTOÑO 2022",
"Students.SPRING":"PRIMAVERA 2023",
"Students.falldate0": "29 de agosto de 2022",
"Students.falldate1": "29 de agosto - 6 de septiembre de 2022",
"Students.falldate2": "10 de noviembre - 1 de diciembre de 2022",
"Students.falldate3": "Semestre 11 de noviembre de 2022",
"Students.falldate4": "2 - 19 de diciembre de 2022",
"Students.falldate5": "16 de diciembre de 2022",
"Students.falldate6": "24 de noviembre de 2022",
"Students.falldate7": "24 - 28 de noviembre de 2022",
"Students.falldate8": "25 de noviembre de 2022",
"Students.falldate9": "26 de diciembre de 2022",
"Students.falldescription0": "Comienzo del semestre de otoño",
"Students.falldescription1": "Período de AGREGAR/ELIMINAR para el semestre de otoño 2022",
"Students.falldescription2": "Registro temprano y pago para la primavera de 2023",
"Students.falldescription3": "Día de los Veteranos",
"Students.falldescription4": "Registro regular",
"Students.falldescription5": "Finalización del semestre de otoño",
"Students.falldescription6": "Día de Acción de Gracias",
"Students.falldescription7": "Vacaciones de Acción de Gracias (no hay clases)",
"Students.falldescription8": "Viernes Negro",
"Students.falldescription9": "Día de Navidad",
"Students.springdate0": "1 de enero de 2023",
"Students.springdate1": "16 de enero de 2023",
"Students.springdate2": "23 de enero de 2023",
"Students.springdate3": "23 - 27 de enero de 2023",
"Students.springdate4": "10 - 16 de abril de 2023",
"Students.springdate5": "20 de abril - 9 de mayo de 2023",
"Students.springdate6": "12 - 16 de mayo de 2023",
"Students.springdate7": "12 de mayo de 2023",
"Students.springdescription0": "Día de Año Nuevo",
"Students.springdescription1": "Día de Martin Luther King",
"Students.springdescription2": "Comienzo del semestre de primavera",
"Students.springdescription3": "Período de AGREGAR/ELIMINAR para el semestre de primavera 2023",
"Students.springdescription4": "Vacaciones de primavera (no hay clases)",
"Students.springdescription5": "Registro regular para los semestres de verano y otoño de 2023",
"Students.springdescription6": "Registro tardío para los semestres de verano y otoño de 2023",
"Students.springdescription7": "Finalización del semestre de primavera",
"admissions.title": "ADMISIONES",
"admissions.subtitle": "Requisitos de admisión",
"admissions.masterpro": "Programas de Maestría",
"admissions.masterpro0": "Tener un título de licenciatura de una universidad o instituto (Proporcionar copia de expedientes académicos sellados).",
"admissions.masterpro1": "Enviar una Solicitud de Admisión completada.",
"admissions.masterpro2": "Enviar una tarifa de solicitud única: $100.00 (No reembolsable).",
"admissions.masterpro3": "Enviar un currículum actualizado.",
"admissions.masterpro4": "Enviar 3 cartas de referencia profesional (no de familiares).",
"admissions.masterpro5": "Enviar una declaración personal que describa los logros y objetivos profesionales del solicitante.",
"admissions.masterpro6": "Copia de identificación válida emitida por el gobierno",
"admissions.undergrapro": "Programas de Pregrado",
"admissions.undergrapro0": "Enviar un diploma de escuela secundaria, un GED o prueba de educación postsecundaria.",
"admissions.undergrapro1": "Enviar una Solicitud de Admisión completada.",
"admissions.undergrapro2": "Enviar una tarifa de solicitud única: $100.00 (No reembolsable).",
"admissions.undergrapro3": "Copia de identificación válida emitida por el gobierno",
"scholarships.title": "BECAS",
"scholarships.parr0": "CUC University se compromete a apoyar a estudiantes elegibles a través de una variedad de becas, que se otorgan por semestre y son renovables según el progreso académico satisfactorio. Al completar la solicitud de beca, los candidatos elegibles serán programados para una entrevista y se les pedirá que escriban un ensayo de 300 palabras en el campus. El tema del ensayo será seleccionado al azar.",
"scholarships.parr1": "Todos los estudiantes que reciben becas de CUC University deben mantener un promedio de calificaciones de 3.0 para seguir siendo elegibles para la renovación. Los beneficiarios de becas deben reafirmar su compromiso con los términos de la beca mediante la firma del formulario 'Términos de las Becas Institucionales'.",
"scholarships.parr2": "Las fechas límite de solicitud para cada semestre se publicarán en el sitio web de la universidad. Es importante tener en cuenta que al retirarse o no aprobar cursos, los beneficiarios de ayuda institucional perderán la beca de CUC University y serán responsables financieramente por la matrícula completa del semestre en curso."


}